vertical-pod-autoscaler/experiments/sn-pbr-throughput/5/home.log
Running 15m test @ http://10.105.4.25:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 6.998ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 5.948ms, rate sampling interval: 16ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.65s    12.00s   30.95s    77.32%
    Req/Sec    30.18     39.69   133.00     88.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  177.79ms
 75.000%  415.23ms
 90.000%   29.13s 
 99.000%   30.95s 
 99.900%   32.06s 
 99.990%   32.78s 
 99.999%   32.80s 
100.000%   32.82s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.629     0.000000            1         1.00
      50.559     0.100000         5284         1.11
      81.407     0.200000        10558         1.25
     110.335     0.300000        15832         1.43
     141.183     0.400000        21108         1.67
     177.791     0.500000        26393         2.00
     199.551     0.550000        29031         2.22
     225.791     0.600000        31661         2.50
     258.687     0.650000        34297         2.86
     308.735     0.700000        36938         3.33
     415.231     0.750000        39575         4.00
   25821.183     0.775000        40895         4.44
   26951.679     0.800000        42246         5.00
   27590.655     0.825000        43553         5.71
   28246.015     0.850000        44868         6.67
   28737.535     0.875000        46208         8.00
   28917.759     0.887500        46860         8.89
   29130.751     0.900000        47519        10.00
   29343.743     0.912500        48192        11.43
   29507.583     0.925000        48841        13.33
   29671.423     0.937500        49475        16.00
   29786.111     0.943750        49817        17.78
   29900.799     0.950000        50144        20.00
   30015.487     0.956250        50484        22.86
   30162.943     0.962500        50810        26.67
   30326.783     0.968750        51135        32.00
   30392.319     0.971875        51295        35.56
   30474.239     0.975000        51475        40.00
   30556.159     0.978125        51622        45.71
   30654.463     0.981250        51789        53.33
   30752.767     0.984375        51971        64.00
   30785.535     0.985938        52031        71.11
   30851.071     0.987500        52121        80.00
   30900.223     0.989062        52191        91.43
   30982.143     0.990625        52291       106.67
   31047.679     0.992188        52360       128.00
   31113.215     0.992969        52399       142.22
   31178.751     0.993750        52436       160.00
   31227.903     0.994531        52479       182.86
   31293.439     0.995313        52520       213.33
   31358.975     0.996094        52573       256.00
   31375.359     0.996484        52584       284.44
   31408.127     0.996875        52601       320.00
   31473.663     0.997266        52620       365.71
   31555.583     0.997656        52644       426.67
   31670.271     0.998047        52662       512.00
   31735.807     0.998242        52672       568.89
   31817.727     0.998437        52682       640.00
   31916.031     0.998633        52693       731.43
   32014.335     0.998828        52703       853.33
   32079.871     0.999023        52714      1024.00
   32145.407     0.999121        52718      1137.78
   32325.631     0.999219        52723      1280.00
   32489.471     0.999316        52728      1462.86
   32620.543     0.999414        52734      1706.67
   32653.311     0.999512        52741      2048.00
   32653.311     0.999561        52741      2275.56
   32686.079     0.999609        52745      2560.00
   32702.463     0.999658        52746      2925.71
   32735.231     0.999707        52750      3413.33
   32751.615     0.999756        52754      4096.00
   32751.615     0.999780        52754      4551.11
   32751.615     0.999805        52754      5120.00
   32767.999     0.999829        52756      5851.43
   32784.383     0.999854        52759      6826.67
   32784.383     0.999878        52759      8192.00
   32784.383     0.999890        52759      9102.22
   32784.383     0.999902        52759     10240.00
   32800.767     0.999915        52763     11702.86
   32800.767     0.999927        52763     13653.33
   32800.767     0.999939        52763     16384.00
   32800.767     0.999945        52763     18204.44
   32800.767     0.999951        52763     20480.00
   32800.767     0.999957        52763     23405.71
   32800.767     0.999963        52763     27306.67
   32800.767     0.999969        52763     32768.00
   32800.767     0.999973        52763     36408.89
   32800.767     0.999976        52763     40960.00
   32800.767     0.999979        52763     46811.43
   32817.151     0.999982        52764     54613.33
   32817.151     1.000000        52764          inf
#[Mean    =     6649.079, StdDeviation   =    12001.738]
#[Max     =    32800.768, Total count    =        52764]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  53418 requests in 15.00m, 458.89MB read
  Socket errors: connect 0, read 0, write 9, timeout 0
Requests/sec:     59.35
Transfer/sec:    522.09KB